# 1)
# პარამეტრები ფრჩხილებში def ის შემდეგ იწერება. არგუმენტები კი ფრჩხილებში მაგრამ ფუნქციის გამოძახების დროს


# 2)
# ფუნქცია უნდა შევქმნათ def  ის გამოყენებით პითონში


# 3)
# ფუნქცია არის ჩაშენებული პროგრამა რომელიც ასრულებს კონკრეტულ მოქმედებას მისი გამოძახება შეგვიძლია მუდმივად ფუნქციის გამოყენება უკეთესია რადგან უფრო სწრაფად და მარტივად შევძლებთ რაიმე მოქმედების შესრულებას


# 4)
def num(i):
    if i%2 == 0:
        print("number is even")
    else:
        print("number is odd")
num(12)


# 5)
def count_num(lis, num1):
    count = 0
    for i in lis:
        if i == num1:
            count += 1
    return count

print(count_num([1, 2, 3, 4, 2,  5, 3, 6, 7, 8, 9, 2], 2))