# 1)
ამინდი = "ღრუბლიანი"
if ამინდი == "მზიანი":
    print("Wear a Hat")
elif ამინდი == "წვიმიანი":
    print('Wear boots')
elif ამინდი == ("ღრუბლიანი"):
    print('wear a jacket')
else:
    print('Wear a T-shirt')


# 2)
# if მაშინ  მაგალითად თუ წყალი არის elif მაშინ როცა if  უკვე გამოვიყენეთ და სხვა შემთხვევა გვჭირდება 
# if ის გამოყენება ხშირად ცუდია რადგან ყველა სწორ ვარიანტს გამოიტანს

# 3)
name = input('Enter your name: ') # ცვლადში შეაქვს მომხმარებელს სახელი 
vowels = 'aeiouAEIOU' #ცვლადში შეგვაქვს ხმოვანი რიცხვები

count = 0 # ცვლადში შეგვაქვს 0

for i in name: # ამის გამოყენებით ვუვლით შეტანილ სახელს
    if i in vowels: # თუ სახელში იქმნება ხმოვანი
        count +=  1 # თვითოეულ ხმოვანზე 1 ემატება
print(count) # იბეჭდება ხმოვნების რაოდენობა


# 4)
# რადგან მხოლოდ კოლექციას უვლის და სტრინგს